app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "Omnis corrupti quas"], ["created_at", "2021-09-06 14:41:00.659677"], ["updated_at", "2021-09-06 14:41:00.659677"]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "body" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["body", "Omnis "], ["updated_at", "2021-09-06 14:41:24.932284"], ["id", 1]]

  def destroy
    @tweet.destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 1]]